api/app/controllers/songs_controller.rb

    def set_album
      @album = Album.find(params[:album_id]) if params[:album_id]
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 9]]